In [2]:
import pandas as pd

In [32]:
url = 'https://web.stanford.edu/class/archive/cs/cs109/cs109.1166/stuff/titanic.csv'
titanic = pd.read_csv(url)
titanic

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500
...,...,...,...,...,...,...,...,...
882,0,2,Rev. Juozas Montvila,male,27.0,0,0,13.0000
883,1,1,Miss. Margaret Edith Graham,female,19.0,0,0,30.0000
884,0,3,Miss. Catherine Helen Johnston,female,7.0,1,2,23.4500
885,1,1,Mr. Karl Howell Behr,male,26.0,0,0,30.0000
886,0,3,Mr. Patrick Dooley,male,32.0,0,0,7.7500

In [39]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 887 entries, 0 to 886
Data columns (total 8 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Survived                 887 non-null    int64
 1   Pclass                   887 non-null    int64
 2   Name                     887 non-null    object
 3   Gender                   887 non-null    object
 4   Age                      887 non-null    float64
 5   Siblings/Spouses Aboard  887 non-null    int64
 6   Parents/Children Aboard  887 non-null    int64
 7   Fare                     887 non-null    float64
dtypes: float64(2), int64(4), object(2)
memory usage: 55.6+ KB

In [34]:
titanic.Survived.sum()

342

In [35]:
#데이터 파악
titanic.columns

Index(['Survived', 'Pclass', 'Name', 'Sex', 'Age', 'Siblings/Spouses Aboard',
       'Parents/Children Aboard', 'Fare'],
      dtype='object')

In [36]:
#전처리 과정이 제일 시간이많이 소요 되용
#결측치 확인
titanic.isnull().value_counts()
titanic.isnull().sum()

Survived                   0
Pclass                     0
Name                       0
Sex                        0
Age                        0
Siblings/Spouses Aboard    0
Parents/Children Aboard    0
Fare                       0
dtype: int64

In [37]:
#컬럼명 변경
titanic.rename(columns={'Sex':'Gender'},inplace=True)

In [38]:
'''
가설 
- 무엇을 분석할 것인가?
'''

,Survived,Pclass,Name,Gender,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500
...,...,...,...,...,...,...,...,...
882,0,2,Rev. Juozas Montvila,male,27.0,0,0,13.0000
883,1,1,Miss. Margaret Edith Graham,female,19.0,0,0,30.0000
884,0,3,Miss. Catherine Helen Johnston,female,7.0,1,2,23.4500
885,1,1,Mr. Karl Howell Behr,male,26.0,0,0,30.0000
886,0,3,Mr. Patrick Dooley,male,32.0,0,0,7.7500

In [ ]:
#남여 생존자 비율중 성별 비율
#1pclass에 생존 비율 ? 다른 pcalss 보다 높다?
#사망자는 주로 고령자 많았다?

## 생존자의 성별 비율

In [70]:
titanic_gender_survived = titanic.groupby(['Gender','Survived'])
titanic_gender_survived.size()

Gender  Survived
female  0            81
        1           233
male    0           464
        1           109
dtype: int64

In [171]:
# 성별 비율 총합
female =titanic.loc[titanic['Gender'] == 'female'].count()['Age']
male = titanic.loc[titanic['Gender']=='male'].count()['Age']

## 성별 전체의 사망자와 생존자 비율 남녀로
titanic_female = titanic_gender_survived.get_group(('female',1))
titanic_male = titanic_gender_survived.get_group(('male',1))
titanic_female_d = titanic_gender_survived.get_group(('female',0))
titanic_male_d = titanic_gender_survived.get_group(('male',0))

titanic_female_dead = (titanic_female_d['Survived'].count()/female * 100).round(2)
titanic_male_dead = (titanic_male_d['Survived'].count()/male *100).round(2)
titanic_female_survived = (titanic_female.sum()['Survived']/female *100).round(2)
titanic_male_survived = (titanic_male.sum()['Survived']/male * 100).round(2)

In [176]:
# 성별에 따른 생존자와 사망자 수 계산
female_survived = titanic[(titanic['Gender'] == 'female') & (titanic['Survived'] == 1)].count()['Survived']
female_dead = titanic[(titanic['Gender'] == 'female') & (titanic['Survived'] == 0)].count()['Survived']
male_survived = titanic[(titanic['Gender'] == 'male') & (titanic['Survived'] == 1)].count()['Survived']
male_dead = titanic[(titanic['Gender'] == 'male') & (titanic['Survived'] == 0)].count()['Survived']

# 여성과 남성의 생존자와 사망자 비율 계산
female_ratio_survived = (female_survived / female) * 100
female_ratio_dead = (female_dead / female) * 100
male_ratio_survived = (male_survived / male) * 100
male_ratio_dead = (male_dead / male) * 100

In [ ]:
# 성별에 따른 생존자와 사망자 수 계산
gender_counts = titanic['Gender'].value_counts()
female_survived = titanic.loc[(titanic['Gender'] == 'female') & (titanic['Survived'] == 1), 'Gender'].count()
male_survived = titanic.loc[(titanic['Gender'] == 'male') & (titanic['Survived'] == 1), 'Gender'].count()
female_dead = gender_counts['female'] - female_survived
male_dead = gender_counts['male'] - male_survived

# 여성과 남성의 생존자와 사망자 비율 계산
female_ratio_survived = (female_survived / gender_counts['female']) * 100
female_ratio_dead = (female_dead / gender_counts['female']) * 100
male_ratio_survived = (male_survived / gender_counts['male']) * 100
male_ratio_dead = (male_dead / gender_counts['male']) * 100

In [177]:
print(female_ratio_survived)

74.20382165605095

In [175]:
print("여자 생존자",titanic_female_survived)
print("남자 생존자",titanic_male_survived)
print("여자 죽은사람",titanic_female_dead)
print("남자 죽은 사람",titanic_male_dead)

여자 생존자 74.2
남자 생존자 19.02
여자 죽은사람 25.8
남자 죽은 사람 80.98

In [146]:
titanic_female_survived + titanic_male_survived + titanic_male_dead + titanic_female_dead == 887

True

## 방법1

In [185]:

##생존자 데이터
#성별 인원 수
survived_gender = titanic[titanic.Survived == 1].groupby(['Gender']).size()

In [187]:
#생존자의 비율
survived_gender / survived_gender.sum() *100

Gender
female    68.128655
male      31.871345
dtype: float64

## 방법2

In [195]:
#비율 value_counts(normalize=True) 
titanic[titanic.Survived== 1].Gender.value_counts(normalize=True) *100

Gender
female    68.128655
male      31.871345
Name: proportion, dtype: float64

In [ ]:
titanic[titanic.Survived== 1].Gender.value_counts(normalize=True) *100

In [213]:
#표현 차이 성별 안 생존자를 나누는게 편해요
g_s = titanic.groupby('Gender').Survived.value_counts(normalize=True).sort_index() * 100 
g_s

Gender  Survived
female  0           25.796178
        1           74.203822
male    0           80.977312
        1           19.022688
Name: proportion, dtype: float64

In [219]:
# 데이터를 펼쳐요
g_s.unstack()

Survived          0          1
Gender
female    25.796178  74.203822
male      80.977312  19.022688

In [224]:
g_s.unstack('Gender')

Gender       female       male
Survived
0         25.796178  80.977312
1         74.203822  19.022688

In [225]:
#흩어지게 하고
g_s.unstack(0)

Gender       female       male
Survived
0         25.796178  80.977312
1         74.203822  19.022688

In [228]:
#다시 인덱스로 오게 하여 stack 해영
g_s.unstack(0).stack()

Survived  Gender
0         female    25.796178
          male      80.977312
1         female    74.203822
          male      19.022688
dtype: float64

In [236]:
#행 인덱스 순서를 바꿔용
g_s.swaplevel().sort_index()

Survived  Gender
0         female    25.796178
          male      80.977312
1         female    74.203822
          male      19.022688
Name: proportion, dtype: float64

## 시각화를 하기

# 1pclass에 생존 비율 ? 다른 pcalss 보다 높다?

In [100]:
titanic_pclass_surcived = titanic.groupby(['Pclass','Survived'])
titanic_pclass_surcived.size()

Pclass  Survived
1       0            80
        1           136
2       0            97
        1            87
3       0           368
        1           119
dtype: int64

In [104]:
frist = titanic_pclass_surcived.get_group((1,1))
second = titanic_pclass_surcived.get_group((2,1))
thord = titanic_pclass_surcived.get_group((3,1))
frist = (frist.sum()['Survived'] / titanic.Survived.sum() *100).round(2)
second = (second.sum()['Survived'] / titanic.Survived.sum() *100).round(2)
thord = (thord.sum()['Survived'] / titanic.Survived.sum() *100).round(2)

In [109]:
print(frist)
print(second)
print(thord)

39.77
25.44
34.8

In [ ]:
titanic.groupby('Gender').Survived.value_counts(normalize=True)